In [2]:
import pandas as pd
import numpy as np

df=pd.DataFrame(np.random.randn(5,3),index=['a','c','e','f','h'],columns=['one','two','three'])
print(df)
df=df.reindex(['a','b','c','d','e','f','g','h'])
print(df)
print(df['one'].median())
print(df['one'].isnull())
df.isnull().any()

#Total missing value for each attribute
print(df.isnull().sum())
#any missing value
print(df['one'].isnull().values.any())

        one       two     three
a -1.502953  2.522569 -1.206214
c -0.622701 -0.233286  0.114183
e  1.265052 -0.985314  1.424891
f  0.859388 -1.878842 -0.296355
h -1.383751 -0.685520 -0.580249
        one       two     three
a -1.502953  2.522569 -1.206214
b       NaN       NaN       NaN
c -0.622701 -0.233286  0.114183
d       NaN       NaN       NaN
e  1.265052 -0.985314  1.424891
f  0.859388 -1.878842 -0.296355
g       NaN       NaN       NaN
h -1.383751 -0.685520 -0.580249
-0.6227014504510724
a    False
b     True
c    False
d     True
e    False
f    False
g     True
h    False
Name: one, dtype: bool
one      3
two      3
three    3
dtype: int64
True

In [3]:
#total number of missing values
print(df.isnull().sum().sum())

9

In [5]:
print('NaN is replaced with 0')
print(df.fillna(0))
#fills the NaN with 0

NaN is replaced with 0
        one       two     three
a -1.502953  2.522569 -1.206214
b  0.000000  0.000000  0.000000
c -0.622701 -0.233286  0.114183
d  0.000000  0.000000  0.000000
e  1.265052 -0.985314  1.424891
f  0.859388 -1.878842 -0.296355
g  0.000000  0.000000  0.000000
h -1.383751 -0.685520 -0.580249

In [7]:
print(df)
print(df.fillna(method='pad'))
#fills the NaN with the previous value of the row of a particular column

        one       two     three
a -1.502953  2.522569 -1.206214
b       NaN       NaN       NaN
c -0.622701 -0.233286  0.114183
d       NaN       NaN       NaN
e  1.265052 -0.985314  1.424891
f  0.859388 -1.878842 -0.296355
g       NaN       NaN       NaN
h -1.383751 -0.685520 -0.580249
        one       two     three
a -1.502953  2.522569 -1.206214
b -1.502953  2.522569 -1.206214
c -0.622701 -0.233286  0.114183
d -0.622701 -0.233286  0.114183
e  1.265052 -0.985314  1.424891
f  0.859388 -1.878842 -0.296355
g  0.859388 -1.878842 -0.296355
h -1.383751 -0.685520 -0.580249

In [8]:
print(df)
print(df.fillna(method='bfill'))
#it fills the NaN with the value preceding a row of a column

        one       two     three
a -1.502953  2.522569 -1.206214
b       NaN       NaN       NaN
c -0.622701 -0.233286  0.114183
d       NaN       NaN       NaN
e  1.265052 -0.985314  1.424891
f  0.859388 -1.878842 -0.296355
g       NaN       NaN       NaN
h -1.383751 -0.685520 -0.580249
        one       two     three
a -1.502953  2.522569 -1.206214
b -0.622701 -0.233286  0.114183
c -0.622701 -0.233286  0.114183
d  1.265052 -0.985314  1.424891
e  1.265052 -0.985314  1.424891
f  0.859388 -1.878842 -0.296355
g -1.383751 -0.685520 -0.580249
h -1.383751 -0.685520 -0.580249

In [9]:
print(df)
print(df.interpolate())
#fills NaN with the average of the forward and the backward values in rows of a particular column

        one       two     three
a -1.502953  2.522569 -1.206214
b       NaN       NaN       NaN
c -0.622701 -0.233286  0.114183
d       NaN       NaN       NaN
e  1.265052 -0.985314  1.424891
f  0.859388 -1.878842 -0.296355
g       NaN       NaN       NaN
h -1.383751 -0.685520 -0.580249
        one       two     three
a -1.502953  2.522569 -1.206214
b -1.062827  1.144641 -0.546015
c -0.622701 -0.233286  0.114183
d  0.321175 -0.609300  0.769537
e  1.265052 -0.985314  1.424891
f  0.859388 -1.878842 -0.296355
g -0.262182 -1.282181 -0.438302
h -1.383751 -0.685520 -0.580249

In [11]:
print(df)
print(df.dropna())
#drops the observations having NaN values

        one       two     three
a -1.502953  2.522569 -1.206214
b       NaN       NaN       NaN
c -0.622701 -0.233286  0.114183
d       NaN       NaN       NaN
e  1.265052 -0.985314  1.424891
f  0.859388 -1.878842 -0.296355
g       NaN       NaN       NaN
h -1.383751 -0.685520 -0.580249
        one       two     three
a -1.502953  2.522569 -1.206214
c -0.622701 -0.233286  0.114183
e  1.265052 -0.985314  1.424891
f  0.859388 -1.878842 -0.296355
h -1.383751 -0.685520 -0.580249

In [12]:
df['one'].dropna()
#drops the missing value of a particular column specified by the user

a   -1.502953
c   -0.622701
e    1.265052
f    0.859388
h   -1.383751
Name: one, dtype: float64

In [13]:
df=pd.DataFrame({'brand':['YumYum','YumYum','Indomie','Indomie','Indomie'],
                'style':['cup','cup','cup','pack','pack'],
                'rating':[4,4,3.5,15,5]})
df

     brand style  rating
0   YumYum   cup     4.0
1   YumYum   cup     4.0
2  Indomie   cup     3.5
3  Indomie  pack    15.0
4  Indomie  pack     5.0

In [14]:
df.drop_duplicates()
#drops observation having all the columns of the same data

     brand style  rating
0   YumYum   cup     4.0
2  Indomie   cup     3.5
3  Indomie  pack    15.0
4  Indomie  pack     5.0

In [15]:
df.drop_duplicates(subset=['brand'])
#drops the observation having the same value based on the parameter specified by the user

     brand style  rating
0   YumYum   cup     4.0
2  Indomie   cup     3.5

In [16]:
df.drop_duplicates(subset=['style'])

     brand style  rating
0   YumYum   cup     4.0
3  Indomie  pack    15.0

In [17]:
df.drop_duplicates(subset=['rating'])

     brand style  rating
0   YumYum   cup     4.0
2  Indomie   cup     3.5
3  Indomie  pack    15.0
4  Indomie  pack     5.0

In [20]:
df.drop_duplicates(subset=['brand','style'],keep='last')
#it retains the duplicate value of the last row

     brand style  rating
1   YumYum   cup     4.0
2  Indomie   cup     3.5
4  Indomie  pack     5.0